app/controllers/products_controller.rb

SELECT `products`.* FROM `products` ORDER BY open_date DESC LIMIT 20
---
  def index
    @products = Product.order('open_date DESC').limit(20)

SELECT `products`.* FROM `products` WHERE (title LIKE('%愛%')) LIMIT 20
---
  def search
    if params[:keyword] == nil
      @products = []
    else
      @products = Product.where('title LIKE(?)', "%#{params[:keyword]}%").limit(20)